-- usersテーブル　ユーザー1と3:初期背景と初期アバター選択中, ユーザー2:花火の背景と初期アバター選択中
insert into users (username, password, background_id, avatar_id) values
('dojouser1', 'dojouser1', 1, 1),
('dojouser2', 'dojouser2', 5, 1),
('dojouser3', 'dojouser3', 1, 1);

-- user_imagesテーブル　ユーザー1と3:初期背景と初期アバター所持, ユーザー2:全背景と初期アバター所持
insert into user_images (user_id, image_type, image_id) values
(1, 0, 1),
(1, 1, 1),
(2, 0, 1),
(2, 1, 1),
(2, 1, 2),
(2, 1, 3),
(2, 1, 4),
(2, 1, 5),
(2, 0, 2),
(2, 0, 3),
(2, 0, 4),
(2, 0, 5),
(3, 0, 1),
(3, 1, 1);

-- vacationsテーブル　ユーザー1:今年の夏休み, ユーザー2:去年と今年の夏休み, ユーザー3:未登録
insert into vacations (user_id, vacation_name, start_date, end_date, decision_date, current_location) values
(1, '夏休み', '2025-07-20', '2025-08-31', '2025-07-20', 0),
(2, '夏休み', '2025-07-19', '2025-08-24', '2025-07-19', 0),
(2, '夏休み', '2024-07-20', '2024-08-25', '2024-07-20', 0),
(1, '冬休み', '2024-12-20', '2025-01-10', '2024-12-20', 0),
(1, '春休み', '2024-03-20', '2024-04-01', '2024-03-20', 0);

insert into user_vacation_backgrounds (vacations_id, backgrounds_id, is_gain, content_order) values
(1, 1, 0, 1),
(1, 2, 0, 2),
(1, 3, 0, 3),
(1, 4, 0, 4),
(2, 1, 0, 1),
(2, 2, 0, 2),
(2, 3, 0, 3),
(2, 4, 0, 4),
(3, 1, 0, 1),
(3, 2, 0, 2),
(3, 3, 0, 3),
(3, 4, 0, 4),
(4, 5, 0, 1),
(4, 6, 0, 2),
(4, 7, 0, 3),
(4, 8, 0, 4),
(5, 9, 0, 1),
(5, 10, 0, 2),
(5, 11, 0, 3),
(5, 12, 0, 4);


insert into vacation_backgrounds (vacation_switch, backgrounds_id, content_order) values
(0, 1, 1), -- 夏休み
(0, 2, 2),
(0, 3, 3),
(0, 4, 4),
(1, 5, 1), -- 冬休み
(1, 6, 2),
(1, 7, 3),
(1, 8, 4),
(2, 9, 1), -- 春休み
(2, 10, 2),
(2, 11, 3),
(2, 12, 4);

-- private_schedulesテーブル
insert into private_schedules (user_id, content, content_date, vacation_id) values
(1, 'じゅく', '2025-07-20', 1),
(1, '海', '2025-08-01', 1),
(2, 'りょこう', '2025-07-23', 2),
(2, 'りょこう', '2025-07-24', 2),
(2, 'はなび', '2024-08-10', 3),
(1, '元旦', '2025-01-01', 4),
(1, 'お花見', '2024-03-29', 5);

-- homework_schedulesテーブル
insert into homework_schedules (user_id, column_info_id, content, content_date, completed, content_order, vacation_id) values
(1, 1, 'p1~3', '2025-07-20', 0, 0, 1),
(1, 1, 'p4~6', '2025-07-21', 0, 0, 1),
(1, 1, 'p7~8', '2025-07-21', 0, 0, 1),
(1, 2, '本を選ぶ', '2025-07-21', 0, 0, 1),
(1, 2, '本を選ぶ', '2025-08-05', 0, 0, 1),
(2, 7, 'テーマ決め', '2025-07-27', 0, 0, 2),
(2, 7, '材料集め', '2025-07-28', 0, 0, 2),
(2, 11, '5ページ', '2024-08-08', 0, 0, 3),
(1, 11, '5ページ', '2025-01-08', 0, 0, 4),
(1, 11, '5ページ', '2024-03-28', 0, 0, 5);

-- columnsテーブル
insert into columns (user_id, column_title, position, vacation_id) values
(1, '休み帳', 1, 1),
(1, '読書感想文', 2, 1),
(1, '自由研究', 3, 1),
(1, 'プリント', 4, 1),
(2, '休み帳', 1, 2),
(2, '読書感想文', 2, 2),
(2, '自由研究', 3, 2),
(2, '休み帳', 1, 3),
(2, '読書感想文', 2, 3),
(2, '自由研究', 3, 3),
(2, 'ドリル', 4, 3),
(1, '算数ドリル', 4, 4),
(1, '漢字ドリル', 4, 5);

-- booksテーブル
insert into books (author, name, overview, pages, grade) values
('ルース・スタイルス・ガネット', 'エルマーのぼうけん', '年取ったのらねこからどうぶつ島に囚われているりゅうの子どもの話を聞いたエルマーは、りゅうの子どもを助ける冒険の旅に出発します。どうぶつ島ではライオン、トラ、サイなど恐ろしい動物たちが待ちうけていました。エルマーは、知恵と勇気で出発前にリュックにつめた輪ゴムやチューインガム、歯ブラシをつかって、次々と動物たちをやりこめていきます。エルマーはりゅうの子どもを助け出すことができるのでしょうか？', 128, 1),
('著者1-2', 'ふたりはともだち', '概要1-2', 63, 1),
('著者1-3', 'もりのゆうびんきょく', '概要1-3', 31, 1),
('著者2-1', 'それで、いい！', '概要2-1', 79, 2),
('著者2-2', 'はれときどきぶた', '概要2-2', 80, 2),
('著者2-3', '一さつのおくりもの', '概要2-3', 80, 2),
('著者3-1', '海底二万マイル', '概要3-1', 154, 3),
('著者3-2', 'チョコレート戦争', '概要3-2', 189, 3),
('著者3-3', 'ふしぎ駄菓子屋銭天堂', '概要3-3', 150, 3),
('著者4-1', '長くつ下のピッピ', '概要4-1', 256, 4),
('著者4-2', 'あらしのよるに', '概要4-2', 266, 4),
('著者4-3', 'ルドルフとイッパイアッテナ', '概要4-3', 274, 4),
('著者5-1', '霧のむこうのふしぎな町', '概要5-1', 216, 5),
('著者5-2', '夏の庭', '概要5-2', 224, 5),
('著者5-3', 'ライオンと魔女', '概要5-3', 288, 5),
('著者6-1', 'ハリー・ポッターと賢者の石', '概要6-1', 272, 6),
('著者6-2', 'ぼくらの七日間戦争', '概要6-2', 343, 6),
('著者6-3', '十五少年漂流記', '概要6-3', 285, 6);

-- event_themesテーブル
insert into event_themes (title, theme, start_date, end_date) values
('2025年夏休み直前イベント① (7/13~7/19)', '新しい学校の怪談！？どんなの？', '2025-07-13', '2025-07-19'),
('2025年夏休み直前イベント② (7/20~7/26)', '校長先生が終業式で放った驚きの一言とは？', '2025-07-20', '2025-07-26'),
('2025年第1回夏休みイベント (7/27~8/2)', 'こんな夏休みの宿題はイヤだ！', '2025-07-27', '2025-08-02'),
('2025年第2回夏休みイベント (8/3~8/9)', '新しい学校の怪談！？どんなの？', '2025-08-03', '2025-08-09'),
('2025年第3回夏休みイベント (8/10~8/16)', '打ち上げ花火から飛び出した、驚きのものとは？', '2025-08-10', '2025-08-16'),
('2025年第4回夏休みイベント (8/17~8/23)', 'スイカの種を食べちゃった！そのあとどうなった？', '2025-08-17', '2025-08-23');

-- user_postsテーブル
insert into user_posts (event_id, user_id, content, count) values
(1, 1, 'トイレの花子さんがWi-Fi貸してくれる', 1),
(1, 2, '夜の体育館に現れる霊、ダンスバトルを挑んでくる', 0),
(2, 1, '宿題は先生がやります！', 0),
(2, 2, '夏休みはありません！！', 0),
(2, 3, '実は私、校長先生じゃないんです', 1),
(3, 1, '辞書で読書感想文を書く', 1),
(3, 3, '毎日登校して先生に挨拶をする', 0);

-- evaluationsテーブル
insert into evaluations (post_id, user_id) values
(1, 2),
(5, 1),
(6, 1);

-- triviasテーブル
insert into trivias (date, content) values
('2025-07-16', '7/16の豆知識'),
('2025-07-17', '7/17の豆知識'),
('2025-07-18', '7/18の豆知識'),
('2025-07-22', '7/22の豆知識'),
('2025-07-23', '7/23の豆知識'),
('2025-07-24', '7/24の豆知識'),
('2025-07-25', '7/25の豆知識'),
('2025-07-27', '人が地球を歩いて1周するには333日かかる'),
('2025-07-28', 'かき氷のシロップは色と香りが違うだけで、味はほぼ同じ'),
('2025-07-29', '1円玉を作るのに必要な金額は2円'),
('2025-07-30', '南極は寒すぎて菌がいないため、風邪をひかない'),
('2025-07-31', 'キリンの睡眠時間は1日20分ほど'),
('2025-08-01', '宇宙服は1着で約10億円'),
('2025-08-02', 'アジサイは土の成分によって花の色が変わる');


